Satelles157/zigrid/sdkconfig.defaults
# Zigrid ESP32-C6 Default Configuration

# ESP32-C6 Target
CONFIG_IDF_TARGET="esp32c6"

# Enable USB Serial/JTAG Console
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Zigbee configuration (to be enabled when Zigbee is integrated)
# CONFIG_ZB_ENABLED=y
# CONFIG_ZB_RADIO_NATIVE=y

# FreeRTOS configuration
CONFIG_FREERTOS_HZ=1000

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Compiler options
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
